# ItemFactoryBase Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ItemFactoryBase Properties
ItemFactoryBase Class See Also
---
The ItemFactoryBase type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace